** What's This?

This document provides an introduction to and guidance for designing an
Application-Custom Client/Server Communication and Coordination Protocol and
Implementation.

An example of such a Protocol for a simple Guessing Game is described in the
files
#+begin_src sh
  ls game-*.{rkt,org} | sort | sed 's/\(.*\)/[[file:\1][\1]]/'
#+end_src

#+RESULTS:
| [[file:game-protocol-1.org][game-protocol-1.org]] |
| [[file:game-protocol-1.rkt][game-protocol-1.rkt]] |
| [[file:game-serve-1.rkt][game-serve-1.rkt]]    |


Abstract Example
#+begin_src plantuml :results verbatim
  Client -> Server : Connect
  Client -> Server : Authenticate
  mainframe "loop"
    Client -> Server : Request Resource
    Client <- Server : Provide Resource
  Client -> Server : Disconnect
#+end_src
#+RESULTS:
#+begin_example
     ,------.          ,------.
     |Client|          |Server|
     `--+---'          `--+---'
        |     Connect     |
        | ---------------->
        |                 |
        |   Authenticate  |
        | ---------------->
        |                 |
        | Request Resource|
        | ---------------->
        |                 |
        | Provide Resource|
        | <----------------
        |                 |
        |    Disconnect   |
        | ---------------->
     ,--+---.          ,--+---.
     |Client|          |Server|
     `------'          `------'
#+end_example


